/**
 *  模块单例性
 *   定义好的模块，在其他一个页面
 */
const defaultItem = '不限'
const categorys = {
  relation: {
    name: 'relation',
    icon:'../../icon/object.png',
    title: '关系',
    allTitle: '送礼对象',
    items: ["爸爸","妈妈","老公男友","老婆女友","基友","闺蜜","朋友","同事","老板"],
    selectedIndex: -1,
    kv:{
      "不限":"不限",
      "爸爸":"爸爸",
      "妈妈":"妈妈",
      "老公男友":"老公男友",
      "老婆女友":"老婆女友",
      "基友":"基友",
      "闺蜜":"闺蜜",
      "朋友":"朋友",
      "同事":"同事",
      "老板":"老板"
    }
  },

  scene: {
    name:'scene',
    title: '场景',
    allTitle: '送礼场景',
    icon:'../../icon/scene.png',
    items: ["圣诞节","新年","过年回家","情人节","生日","纪念日","告白","乔迁","新婚"],
    selectedIndex: -1,
    kv:{
      "不限":"不限",
      "圣诞节":"圣诞节",
      "新年":"新年",
      "过年回家":"过年回家",
      "情人节":"情人节",
      "生日":"生日",
      "纪念日":"纪念日",
      "告白":"告白",
      "乔迁":"乔迁",
      "新婚":"新婚"
    }
  },

  category: {
    name: 'category',
    icon:'../../icon/gifts.png',
    title: '品类',
    allTitle: '送礼品类',
    items: ["家具家装","生活日用","家用电器","办公用品","时尚悦己","个护化妆","科技数码","运动健康","吃喝旅行","母婴玩具","汽车户外"],
    selectedIndex: -1,
    kv:{
        "不限":"不限",
        "家具家装":"家具家装",
        "生活日用":"生活日用",
        "家用电器":"家用电器",
        "办公用品":"办公用品",
        "时尚悦己":"时尚悦己",
        "个护化妆":"个护化妆",
        "科技数码":"科技数码",
        "运动健康":"运动健康",
        "吃喝旅行":"吃喝旅行",
        "母婴玩具":"母婴玩具",
        "汽车户外":"汽车户外"
    }

  },
  // charactor: {
  //   name: 'charactor',
  //   title: '性格',
  //   items:["二次元","小清新","萌萌哒","Geek","潮人","文艺范","搞怪","成熟"],
  //   kv: {
  //       "不限":"不限",
  //       "二次元":"二次元",
  //       "小清新":"小清新",
  //       "萌萌哒":"萌萌哒",
  //       "Geek":"Geek",
  //       "潮人":"潮人",
  //       "文艺范":"文艺范",
  //       "搞怪":"搞怪",
  //       "成熟":"成熟"
  //   }
  // },
  price: {
    name: 'price',
    icon:'../../icon/price.png',
    title: '价格',
    allTitle: '礼物价格',
    items: ["0-200","200-500","500-800","800+"],
    selectedIndex: -1,
    kv:{
      "0-200":"0-200",
      "200-500":"200-500",
      "500-800":"500-800",
      "800+":"800+"
    }
  }

}
export default categorys
export { defaultItem }
